{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.1.3", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 300], "sparse": false, "name": "input_6"}, "name": "input_6"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 300], "sparse": false, "name": "input_7"}, "name": "input_7"}, {"class_name": "Model", "inbound_nodes": [[["input_6", 0, 0, {}]], [["input_7", 0, 0, {}]]], "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 300], "name": "input_5", "dtype": "float32", "sparse": false}, "name": "input_5"}, {"class_name": "Dense", "inbound_nodes": [[["input_5", 0, 0, {}]]], "config": {"use_bias": true, "bias_constraint": null, "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_12", "units": 300}, "name": "dense_12"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["dense_12", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_11", "beta_constraint": null, "center": true, "axis": -1}, "name": "batch_normalization_11"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_10"}, "name": "activation_10"}, {"class_name": "Dropout", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"noise_shape": null, "trainable": true, "rate": 0.2, "seed": null, "name": "dropout_9"}, "name": "dropout_9"}, {"class_name": "Dense", "inbound_nodes": [[["dropout_9", 0, 0, {}]]], "config": {"use_bias": true, "bias_constraint": null, "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_13", "units": 300}, "name": "dense_13"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["dense_13", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_12", "beta_constraint": null, "center": true, "axis": -1}, "name": "batch_normalization_12"}, {"class_name": "Add", "inbound_nodes": [[["activation_10", 0, 0, {}], ["batch_normalization_12", 0, 0, {}]]], "config": {"trainable": true, "name": "add_8"}, "name": "add_8"}, {"class_name": "Activation", "inbound_nodes": [[["add_8", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_11"}, "name": "activation_11"}, {"class_name": "Dropout", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "config": {"noise_shape": null, "trainable": true, "rate": 0.2, "seed": null, "name": "dropout_10"}, "name": "dropout_10"}, {"class_name": "Dense", "inbound_nodes": [[["dropout_10", 0, 0, {}]]], "config": {"use_bias": true, "bias_constraint": null, "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_14", "units": 300}, "name": "dense_14"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["dense_14", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_13", "beta_constraint": null, "center": true, "axis": -1}, "name": "batch_normalization_13"}, {"class_name": "Add", "inbound_nodes": [[["activation_11", 0, 0, {}], ["batch_normalization_13", 0, 0, {}]]], "config": {"trainable": true, "name": "add_9"}, "name": "add_9"}, {"class_name": "Activation", "inbound_nodes": [[["add_9", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_12"}, "name": "activation_12"}, {"class_name": "Dropout", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "config": {"noise_shape": null, "trainable": true, "rate": 0.2, "seed": null, "name": "dropout_11"}, "name": "dropout_11"}, {"class_name": "Dense", "inbound_nodes": [[["dropout_11", 0, 0, {}]]], "config": {"use_bias": true, "bias_constraint": null, "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_15", "units": 300}, "name": "dense_15"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["dense_15", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_14", "beta_constraint": null, "center": true, "axis": -1}, "name": "batch_normalization_14"}, {"class_name": "Add", "inbound_nodes": [[["activation_12", 0, 0, {}], ["batch_normalization_14", 0, 0, {}]]], "config": {"trainable": true, "name": "add_10"}, "name": "add_10"}, {"class_name": "Activation", "inbound_nodes": [[["add_10", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_13"}, "name": "activation_13"}, {"class_name": "Dropout", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "config": {"noise_shape": null, "trainable": true, "rate": 0.2, "seed": null, "name": "dropout_12"}, "name": "dropout_12"}, {"class_name": "Dense", "inbound_nodes": [[["dropout_12", 0, 0, {}]]], "config": {"use_bias": true, "bias_constraint": null, "trainable": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_16", "units": 300}, "name": "dense_16"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["dense_16", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_15", "beta_constraint": null, "center": true, "axis": -1}, "name": "batch_normalization_15"}, {"class_name": "Add", "inbound_nodes": [[["activation_13", 0, 0, {}], ["batch_normalization_15", 0, 0, {}]]], "config": {"trainable": true, "name": "add_11"}, "name": "add_11"}, {"class_name": "Activation", "inbound_nodes": [[["add_11", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_14"}, "name": "activation_14"}, {"class_name": "Concatenate", "inbound_nodes": [[["activation_14", 0, 0, {}], ["activation_13", 0, 0, {}], ["activation_12", 0, 0, {}]]], "config": {"trainable": true, "axis": -1, "name": "concatenate_2"}, "name": "concatenate_2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_16", "beta_constraint": null, "center": true, "axis": -1}, "name": "batch_normalization_16"}], "input_layers": [["input_5", 0, 0]], "output_layers": [["batch_normalization_16", 0, 0]], "name": "model_3"}, "name": "model_3"}, {"class_name": "Lambda", "inbound_nodes": [[["model_3", 1, 0, {}], ["model_3", 2, 0, {}]]], "config": {"output_shape_type": "lambda", "function_type": "lambda", "function": ["4wEAAAAAAAAAAwAAAAcAAABDAAAAczsAAAB8AABcAgB9AQB9AgB0AABqAQB0AABqAgB0AABqAwB8\nAQB8AgAYgwEAZAEAZAIAZAMAZAQAgwECgwEAUykFTtoEYXhpc+kBAAAA2ghrZWVwZGltc1QpBNoB\nS9oEc3FydNoDc3Vt2gZzcXVhcmUpA9oFdmVjdHPaAXjaAXmpAHILAAAA+h88aXB5dGhvbi1pbnB1\ndC0xNS02YzMyZGMzZTYwOTQ+2hJldWNsaWRlYW5fZGlzdGFuY2UBAAAAcwQAAAAAAQwB\n", null, null], "arguments": {}, "trainable": true, "output_shape": ["4wEAAAAAAAAAAwAAAAIAAABDAAAAcxoAAAB8AABcAgB9AQB9AgB8AQBkAQAZZAIAZgIAUykDTukA\nAAAA6QEAAACpACkD2gZzaGFwZXPaBnNoYXBlMdoGc2hhcGUycgMAAAByAwAAAPofPGlweXRob24t\naW5wdXQtMTUtNmMzMmRjM2U2MDk0PtoWZXVjbF9kaXN0X291dHB1dF9zaGFwZQUAAABzBAAAAAAB\nDAE=\n", null, null], "name": "lambda_2"}, "name": "lambda_2"}, {"class_name": "Dense", "inbound_nodes": [[["lambda_2", 0, 0, {}]]], "config": {"use_bias": true, "bias_constraint": null, "trainable": true, "activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_17", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "units": 1}, "name": "dense_17"}], "input_layers": [["input_6", 0, 0], ["input_7", 0, 0]], "output_layers": [["dense_17", 0, 0]], "name": "model_4"}}